[
  {
    "slug": "does-firing-your-coach-actually-work",
    "title": "Does Firing Your Coach Actually Work? What 449 Studies Tell Us",
    "subtitle": "Feyenoord replaced Priske with Van Persie. The Eredivisie is no stranger to mid-season sackings. But what does the research actually say about the new-manager bounce?",
    "date": "2026-02-19",
    "author": "Matthijs Wolters",
    "tags": ["football", "coaching", "gap-analysis", "eredivisie"],
    "related_gap_slug": "does-dismissing-a-football-head-coach-during-the-season-actually-improve-team-pe",
    "image_emoji": "⚽",
    "reading_time_min": 5,
    "body": [
      {
        "type": "paragraph",
        "text": "De Volkskrant published an article recently about an age-old question in football: does sacking your manager actually improve results? The piece referenced Jan van Ours, an economist who has studied exactly this question using Eredivisie data. Feyenoord just went through it themselves — Brian Priske out, Robin van Persie in. So we pointed our AI at our database of nearly 14,000 sports analytics papers and asked: what does the evidence actually say?"
      },
      {
        "type": "paragraph",
        "text": "We found 449 papers across football, basketball, American football, and ice hockey that touch on coaching, performance analysis, and betting markets. Five directly study what happens after a mid-season sacking. The findings? Not what most football fans want to hear."
      },
      {
        "type": "heading",
        "text": "The short answer: probably not (much)"
      },
      {
        "type": "paragraph",
        "text": "Van Ours & Van Tuijl (2014) studied 59 in-season coach changes across 14 Eredivisie seasons. Their key insight: yes, teams perform better after a sacking — but so do teams in similar slumps that kept their coach. The improvement is regression to the mean, not a coaching effect. They used bookmaker odds to construct a control group of 'near-dismissals' that didn't happen, and found no significant difference."
      },
      {
        "type": "ref",
        "work_id": "preprint:393fce3e4ca68520",
        "label": "Van Ours & Van Tuijl (2014)"
      },
      {
        "type": "paragraph",
        "text": "The most methodologically rigorous recent study confirms this. Stachnik (2025) analyzed 115 dismissals in the Polish Ekstraklasa between 2006 and 2024, using ELO ratings to build counterfactual scenarios: what would have happened if the club had simply waited? Same conclusion — the bounce is real, but it would have happened anyway."
      },
      {
        "type": "ref",
        "work_id": "W4409425702",
        "label": "Stachnik (2025)"
      },
      {
        "type": "paragraph",
        "text": "But not everyone agrees. Madum (2016) found a genuine improvement in the Danish Premier League after sackings — though only in home games. That's a curious finding. Is the 'new manager bounce' about tactics, or about the crowd responding to the drama?"
      },
      {
        "type": "ref",
        "work_id": "W2946480687",
        "label": "Madum (2016)"
      },
      {
        "type": "heading",
        "text": "Players literally run differently"
      },
      {
        "type": "paragraph",
        "text": "A 2025 study went beyond goals and points and strapped GPS trackers to players across three coaching regimes at the same club. Petrov et al. (2025) found that high-speed running distance, sprint profiles, and pressing intensity all shifted significantly when the coach changed. So managers do affect how teams play on a physical level. Whether that translates into better results is a different question."
      },
      {
        "type": "ref",
        "work_id": "W4411782569",
        "label": "Petrov et al. (2025)"
      },
      {
        "type": "paragraph",
        "text": "Meanwhile, Poncé-Bordón et al. (2023) found short-term improvements (games 1–5) in Spanish leagues, but the effect faded fast. And Galdino (2025) showed that Brazilian betting markets only adjusted their odds 5–8 games post-sacking — then the signal disappeared."
      },
      {
        "type": "refs",
        "items": [
          {"work_id": "W4388526044", "label": "Poncé-Bordón et al. (2023)"},
          {"work_id": "W4410157616", "label": "Galdino (2025)"}
        ]
      },
      {
        "type": "heading",
        "text": "Nine things nobody has studied"
      },
      {
        "type": "paragraph",
        "text": "Our AI identified nine gaps in the literature — questions researchers could answer with available data but haven't. Some highlights:"
      },
      {
        "type": "list",
        "items": [
          "Nobody has compared different statistical methods on the same dataset. The Polish and Dutch studies used different approaches and got similar conclusions, but the Danish study used yet another method and found the opposite. Is it the method or the league?",
          "Not a single study looks at HOW performance changes after a sacking. Do players run harder out of guilt? Does the new coach actually change the tactical setup? We have GPS data and expected goals models, but nobody has combined them with coaching transitions.",
          "Women's football is completely unstudied. Same goes for lower divisions, amateur football, and most non-European leagues.",
          "Nobody has factored in the quality of the replacement. Getting Robin van Persie is presumably different from getting an interim assistant."
        ]
      },
      {
        "type": "heading",
        "text": "What this means for Feyenoord"
      },
      {
        "type": "paragraph",
        "text": "Feyenoord sacked Priske and appointed Van Persie in February 2025. The early results were bumpy. If the research tells us anything, it's that boards should think harder about why they're making the change. If a team is in a bad run but the underlying metrics (expected goals, physical output, tactical structure) are still reasonable, things often improve on their own."
      },
      {
        "type": "paragraph",
        "text": "The smarter question isn't 'should we fire the coach?' but 'will the replacement actually change something that matters?' Almost no research helps answer that second question — and that's arguably the biggest gap in this entire field."
      },
      {
        "type": "heading",
        "text": "Dive deeper"
      },
      {
        "type": "paragraph",
        "text": "The full gap analysis — 9 identified research gaps, 4 proposed studies, and 41 paper references — is on our Find the Gap page. If you're a student looking for a thesis topic in sports analytics, start there. The data is available, the methods exist, and the questions are wide open."
      }
    ],
    "references": [
      {"work_id": "preprint:393fce3e4ca68520", "citation": "Van Ours, J. C. & Van Tuijl, M. A. (2014). In-season head-coach dismissals and the performance of professional football teams. CentER Discussion Paper No. 2014-058."},
      {"work_id": "W4409425702", "citation": "Stachnik, B. (2025). Managerial turnover and performance: Lessons from the Polish Ekstraklasa."},
      {"work_id": "W2946480687", "citation": "Madum, A. (2016). Managerial turnover and subsequent firm performance: Evidence from Danish soccer teams."},
      {"work_id": "W4411782569", "citation": "Petrov, D. et al. (2025). The impact of managerial changes on physical performance in elite soccer players."},
      {"work_id": "W4388526044", "citation": "Poncé-Bordón, J. C. et al. (2023). The effect of coach dismissal on team performance and match physical demands in Spanish professional soccer leagues."},
      {"work_id": "W4410157616", "citation": "Galdino, M. (2025). Betting (in)efficiency after football coaching replacements in Brazil."},
      {"work_id": "W2751035262", "citation": "Wangrow, D. B. et al. (2017). Power, performance, and expectations in the dismissal of NBA coaches: A survival analysis study."},
      {"work_id": "W3191974746", "citation": "Semmelroth, D. (2021). Time to say goodbye: A duration analysis of the determinants of coach dismissals and quits in Major League Soccer."}
    ]
  }
]
